# Homework 2020-07-09

1. 외국인 남자/여자 비율을 내림차순으로 정렬
2. 한국인 남자/여자 를 내림차순으로 정렬
3. 한국인 남자비율/여자비율을 내림차순으로 정렬

비율 구할 때 총 인구수로!

In [1]:
import pandas as pd

In [2]:
pop_Seoul = pd.read_excel('./data/01. population_in_Seoul.xls', 
                          usecols =  'B, G, H, I, J, K, L',
                          encoding='utf-8')

In [3]:
pop_Seoul.head()

   자치구     인구.3     인구.4     인구.5    인구.6    인구.7    인구.8
0  자치구      한국인      한국인      한국인   등록외국인   등록외국인   등록외국인
1  자치구        계       남자       여자       계      남자      여자
2   합계  9926968  4871560  5055408  270636  128445  142191
3  종로구   153589    75611    77978    9231    4064    5167
4   중구   124312    61656    62656    8928    4134    4794

In [4]:
pop_Seoul_columns = pop_Seoul.columns

In [5]:
pop_Seoul_columns

Index(['자치구', '인구.3', '인구.4', '인구.5', '인구.6', '인구.7', '인구.8'], dtype='object')

In [6]:
pop_Seoul.rename(columns = {
    pop_Seoul_columns[0] : '구별',
    pop_Seoul_columns[1] : '한국인',
    pop_Seoul_columns[2] : '한국인남자',
    pop_Seoul_columns[3] : '한국인여자',
    pop_Seoul_columns[4] : '외국인',
    pop_Seoul_columns[5] : '외국인남자',
    pop_Seoul_columns[6] : '외국인여자'
}, inplace = True)

In [7]:
pop_Seoul.head()

    구별      한국인    한국인남자    한국인여자     외국인   외국인남자   외국인여자
0  자치구      한국인      한국인      한국인   등록외국인   등록외국인   등록외국인
1  자치구        계       남자       여자       계      남자      여자
2   합계  9926968  4871560  5055408  270636  128445  142191
3  종로구   153589    75611    77978    9231    4064    5167
4   중구   124312    61656    62656    8928    4134    4794

In [8]:
pop_Seoul.drop([0,1,2], inplace=True)

In [9]:
pop_Seoul.head()

    구별     한국인   한국인남자   한국인여자    외국인 외국인남자 외국인여자
3  종로구  153589   75611   77978   9231  4064  5167
4   중구  124312   61656   62656   8928  4134  4794
5  용산구  229456  111167  118289  14747  7965  6782
6  성동구  303380  150076  153304   7864  3692  4172
7  광진구  357211  174599  182612  14953  6393  8560

In [10]:
len(pop_Seoul['구별'].unique())

26

In [11]:
pop_Seoul[pop_Seoul['구별'].isnull()]

     구별  한국인 한국인남자 한국인여자  외국인 외국인남자 외국인여자
28  NaN  NaN   NaN   NaN  NaN   NaN   NaN

In [12]:
pop_Seoul.drop([26], inplace=True)
pop_Seoul.head()

    구별     한국인   한국인남자   한국인여자    외국인 외국인남자 외국인여자
3  종로구  153589   75611   77978   9231  4064  5167
4   중구  124312   61656   62656   8928  4134  4794
5  용산구  229456  111167  118289  14747  7965  6782
6  성동구  303380  150076  153304   7864  3692  4172
7  광진구  357211  174599  182612  14953  6393  8560

In [14]:
pop_Seoul['구별'].unique()

array(['종로구', '중구', '용산구', '성동구', '광진구', '동대문구', '중랑구', '성북구', '강북구',
       '도봉구', '노원구', '은평구', '서대문구', '마포구', '양천구', '강서구', '구로구', '금천구',
       '영등포구', '동작구', '관악구', '서초구', '강남구', '강동구', nan], dtype=object)

In [16]:
len(pop_Seoul['구별'].unique())

25

### 1. 외국인
#### 1-1. 외국인 남자
각 구별로 외국인 남자 명수를 내림차순으로 정렬하였다.

In [18]:
pop_Seoul.sort_values(by='외국인남자', ascending=False).head()

      구별     한국인   한국인남자   한국인여자    외국인  외국인남자  외국인여자
21  영등포구  368072  183705  184367  34913  18868  16045
19   구로구  416487  207114  209373  31387  17322  14065
20   금천구  236353  120334  116019  18729  10224   8505
23   관악구  507203  256090  251113  18312   8673   9639
5    용산구  229456  111167  118289  14747   7965   6782

#### 1-2. 외국인 여자
각 구별로 외국인 여자 명수를 내림차순으로 정렬하였다.

In [19]:
pop_Seoul.sort_values(by='외국인여자', ascending=False).head()

      구별     한국인   한국인남자   한국인여자    외국인  외국인남자  외국인여자
21  영등포구  368072  183705  184367  34913  18868  16045
19   구로구  416487  207114  209373  31387  17322  14065
23   관악구  507203  256090  251113  18312   8673   9639
8   동대문구  354079  177021  177058  15417   5911   9506
7    광진구  357211  174599  182612  14953   6393   8560

### 2. 한국인
#### 2-1. 한국인 남자
각 구별로 한국인 남자 명수를 내림차순으로 정렬하였다.

In [20]:
pop_Seoul.sort_values(by='한국인남자', ascending=False).head()

     구별     한국인   한국인남자   한국인여자    외국인 외국인남자 외국인여자
18  강서구  597248  291249  305999   6524  3184  3340
13  노원구  565565  275211  290354   3819  1612  2207
25  강남구  565550  270726  294824   4950  2575  2375
23  관악구  507203  256090  251113  18312  8673  9639
14  은평구  489943  238337  251606   4445  1883  2562

#### 2-1. 한국인 여자
각 구별로 한국인 여자 명수를 내림차순으로 정렬하였다.

In [21]:
pop_Seoul.sort_values(by='한국인여자', ascending=False).head()

     구별     한국인   한국인남자   한국인여자    외국인 외국인남자 외국인여자
18  강서구  597248  291249  305999   6524  3184  3340
25  강남구  565550  270726  294824   4950  2575  2375
13  노원구  565565  275211  290354   3819  1612  2207
14  은평구  489943  238337  251606   4445  1883  2562
23  관악구  507203  256090  251113  18312  8673  9639

### 3. 한국인 남녀 비율

In [25]:
pop_Seoul = pop_Seoul[['구별','한국인','한국인남자','한국인여자']]

In [26]:
pop_Seoul.head()

    구별     한국인   한국인남자   한국인여자
3  종로구  153589   75611   77978
4   중구  124312   61656   62656
5  용산구  229456  111167  118289
6  성동구  303380  150076  153304
7  광진구  357211  174599  182612

#### 3-1. 한국인 남자 비율 
각 구별로 한국인 중 남자 명수의 비율을 구해 내림차순 정렬하였다.

In [27]:
pop_Seoul['한국인남자비율'] = pop_Seoul['한국인남자'] / pop_Seoul['한국인'] * 100

In [28]:
pop_Seoul.sort_values(by='한국인남자비율', ascending=False).head()

      구별     한국인   한국인남자   한국인여자  한국인남자비율
20   금천구  236353  120334  116019  50.9128
23   관악구  507203  256090  251113  50.4906
8   동대문구  354079  177021  177058  49.9948
21  영등포구  368072  183705  184367  49.9101
9    중랑구  409882  204265  205617  49.8351

#### 3-2. 한국인 여자 비율
각 구별로 한국인 중 여자 명수의 비율을 구해 내림차순 정렬하였다.

In [29]:
pop_Seoul['한국인여자비율'] = pop_Seoul['한국인여자'] / pop_Seoul['한국인'] * 100

In [30]:
pop_Seoul.sort_values(by='한국인여자비율', ascending=False).head()

      구별     한국인   한국인남자   한국인여자  한국인남자비율  한국인여자비율
25   강남구  565550  270726  294824  47.8695  52.1305
16   마포구  378566  181346  197220  47.9034  52.0966
24   서초구  445994  214036  231958  47.9908  52.0092
5    용산구  229456  111167  118289  48.4481  51.5519
15  서대문구  314982  152613  162369  48.4513  51.5487